In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Project folder path
path = r'C:\Users\BhuwanDhakal\Sunita\Projects\2 Data Immersion\Data Ethics & Applied Analytics\Exercise 5.4'

In [3]:
path

'C:\\Users\\BhuwanDhakal\\Sunita\\Projects\\2 Data Immersion\\Data Ethics & Applied Analytics\\Exercise 5.4'

In [4]:
# Import Data
Data= pd.read_excel(os.path.join(path, '5.4-PigEBank-Client-Data set.xlsx'))

In [5]:
Data.head()

,Row_Number,Customer_ID,Last_Name,Credit Score,Country,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
0,1,15634602,Hargrave,619.0,France,Female,42.0,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608.0,Spain,Female,41.0,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502.0,France,Female,42.0,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699.0,France,Female,39.0,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850.0,Spain,Female,43.0,2,125510.82,1,1,1,79084.10,0

In [6]:
# Checking the number of rowa and column before cleaning
Data.shape

(991, 14)

In [7]:
# Checking statistics
Data.describe()

,Row_Number,Customer_ID,Credit Score,Age,Tenure,Balance,NumOfProducts,HasCrCard?,IsActiveMember,Estimated Salary,ExitedFromBank?
count,991.00000,9.910000e+02,988.000000,990.000000,991.000000,991.000000,991.000000,991.000000,991.000000,989.000000,991.000000
mean,496.00000,1.569232e+07,648.512146,38.684848,5.066599,78002.718063,1.522704,0.706357,0.507568,98574.543013,0.205853
std,286.22136,7.223333e+04,98.202853,10.958220,2.928371,62799.237345,0.573170,0.455660,0.500195,57224.716446,0.404527
min,1.00000,1.556609e+07,376.000000,2.000000,0.000000,0.000000,1.000000,0.000000,0.000000,371.050000,0.000000
25%,248.50000,1.563019e+07,579.750000,32.000000,2.000000,0.000000,1.000000,0.000000,0.000000,48559.190000,0.000000
50%,496.00000,1.569275e+07,653.500000,37.000000,5.000000,98668.180000,1.000000,1.000000,1.000000,98368.240000,0.000000
75%,743.50000,1.575379e+07,721.000000,44.000000,8.000000,129461.850000,2.000000,1.000000,1.000000,146326.450000,0.000000
max,991.00000,1.581536e+07,850.000000,82.000000,10.000000,213146.200000,4.000000,1.000000,1.000000,199725.390000,1.000000

In [8]:
# Rename column HasCrCard? to HasCreditCard?
Data.rename(columns={'HasCrCard?' : 'HasCreditCard?'}, inplace = True)

In [9]:
# Dropping Column Row_number and Last name
Data_1 = Data.drop(columns = ['Row_Number', 'Last_Name'])

In [10]:
# Finding the Missing values in the Dataframe
Data_1.isnull().sum()

Customer_ID         0
Credit Score        3
Country             0
Gender              1
Age                 1
Tenure              0
Balance             0
NumOfProducts       0
HasCreditCard?      0
IsActiveMember      0
Estimated Salary    2
ExitedFromBank?     0
dtype: int64

In [11]:
# Checking the Data types
Data_1.dtypes

Customer_ID           int64
Credit Score        float64
Country              object
Gender               object
Age                 float64
Tenure                int64
Balance             float64
NumOfProducts         int64
HasCreditCard?        int64
IsActiveMember        int64
Estimated Salary    float64
ExitedFromBank?       int64
dtype: object

In [12]:
# Changing Data type of Customer_ID in Data_1
Data_1['Customer_ID'] = Data_1['Customer_ID'].astype('str')

In [13]:
Data_1['Customer_ID'].dtype

dtype('O')

In [14]:
# Changing Data type of HasCreditCard?, IsActiveMember, ExitedFromBank? in Data_1
Data_1[['HasCreditCard?','IsActiveMember','ExitedFromBank?']] = Data_1[['HasCreditCard?','IsActiveMember','ExitedFromBank?']].astype('str')

In [15]:
Data_1.dtypes

Customer_ID          object
Credit Score        float64
Country              object
Gender               object
Age                 float64
Tenure                int64
Balance             float64
NumOfProducts         int64
HasCreditCard?       object
IsActiveMember       object
Estimated Salary    float64
ExitedFromBank?      object
dtype: object

In [16]:
# Check for the mixed data types
for col in Data_1.columns.tolist():
  weird = Data_1[[col]].applymap(type) != Data_1[[col]].iloc[0].apply(type).any()
if len (Data_1[weird]) > 0:
    print ("Column " + col + " has mixed data type")
else:
    print ("No columns with mixed datatype")

Column ExitedFromBank? has mixed data type

In [17]:
#checking the values in the mixed data type column
Data_1['ExitedFromBank?'].unique()

array(['1', '0'], dtype=object)

Since the values are only 0 and 1, we will leave as it is

In [18]:
# Finding Duplicates
Data_1_dups = Data_1[Data_1.duplicated()]

In [19]:
Data_1_dups

Empty DataFrame
Columns: [Customer_ID, Credit Score, Country, Gender, Age, Tenure, Balance, NumOfProducts, HasCreditCard?, IsActiveMember, Estimated Salary, ExitedFromBank?]
Index: []

There are no duplicate in the dataframe

In [20]:
# Checking the Country columns values
Data_1['Country'].unique()

array(['France', 'Spain', 'Germany', 'FR', 'ES', 'DE'], dtype=object)

In [21]:
# In Country Column Replacing FR as France, Es as Spain and De as Germany
Data_1['Country'].replace({'FR': 'France', 'ES': 'Spain', 'DE': 'Germany'}, inplace=True)

In [22]:
 # Checking the Gender columns values
Data_1['Gender'].unique()

array(['Female', 'Male', nan, 'M', 'F'], dtype=object)

In [23]:
# In gender column Replacing M as Male,F as Female and nan to Unknown
Data_1['Gender'].replace({'F': 'Female', 'M': 'Male', 'nan': 'Unknown'}, inplace = True)

In [24]:
Data_1['Age'].replace({ 2: np.nan}, inplace = True)

In [25]:
Data_1.shape

(991, 12)

In [26]:
Data_1['Age'].isnull().sum()

12

In [27]:
# Export Clean Data
Data_1.to_excel(os.path.join(path, '5.4-PigEBank-Client_cleaned-Data set.xlsx'))

In [28]:
df1 = Data_1.loc[Data_1['ExitedFromBank?'] == '1'] # Clints who exited from the bank.

In [32]:
df1.describe()

,Credit Score,Age,Tenure,Balance,NumOfProducts,Estimated Salary
count,203.000000,202.000000,204.000000,204.000000,204.000000,204.000000
mean,636.512315,45.277228,4.715686,90239.218873,1.460784,97155.204608
std,99.871767,9.578810,2.915484,61352.066625,0.764632,59537.153259
min,376.000000,22.000000,0.000000,0.000000,1.000000,417.410000
25%,561.500000,39.000000,2.000000,0.000000,1.000000,44685.167500
50%,643.000000,45.000000,5.000000,112433.965000,1.000000,100375.400000
75%,714.500000,51.000000,7.000000,133713.527500,2.000000,148291.382500
max,850.000000,69.000000,10.000000,213146.200000,4.000000,199725.390000

In [29]:
df2 = Data_1.loc[Data_1['ExitedFromBank?'] == '0'] # Client who stayedd in the bank.

In [33]:
df2.describe()

,Credit Score,Age,Tenure,Balance,NumOfProducts,Estimated Salary
count,785.000000,777.000000,787.000000,787.000000,787.000000,785.000000
mean,651.615287,37.490347,5.157560,74830.867789,1.538755,98943.390191
std,97.590995,9.872132,2.926683,62819.020794,0.511407,56641.616953
min,411.000000,18.000000,0.000000,0.000000,1.000000,371.050000
25%,583.000000,31.000000,3.000000,0.000000,1.000000,51219.800000
50%,657.000000,36.000000,5.000000,93147.000000,2.000000,98301.610000
75%,723.000000,42.000000,8.000000,127817.875000,2.000000,145936.280000
max,850.000000,82.000000,10.000000,197041.800000,3.000000,199661.500000

In [30]:
 #Copying the df1 data to Excel
df1.to_clipboard()

In [31]:
 #Copying the df2 data to Excel
df2.to_clipboard()